# Case Study #02

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [3]:
data1=pd.read_csv("G:\study\Data Science - ICT\Week6\StudentsPerformance.csv")

In [4]:
data1

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

# 1. Find out how many males and females participated in the test.

In [31]:
data1['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

# 2. What do you think about the student's parental level of education?

In [80]:
data2=data1['parental level of education'].value_counts()

In [81]:
data2

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

In [ ]:
## most parents have an education level of "Some College(226)" and "associate's degree(222)", but parents having master's degree is very less(59).

# 3. Who scores the most on average for math, reading and writing based on 
## ● Gender

In [48]:
avg=data1.groupby('gender')['math score','reading score','writing score'].mean()
avg

        math score  reading score  writing score
gender
female   63.376448      72.590734      72.467181
male     68.821577      65.545643      63.446058

In [ ]:
## Female students have higher average score for reading and writing than male students, but less in maths.

# ● Test preparation course

In [49]:
avg1=data1.groupby('test preparation course')['math score','reading score','writing score'].mean()
avg1

                         math score  reading score  writing score
test preparation course
completed                  69.96648      74.175978      74.684358
none                       63.78972      66.417445      64.457944

In [ ]:
## Test preperation completed students have higher average score in math, reading and writing than Non completed students

# 4. What do you think about the scoring variation for math, reading and writing based on 
## ● Gender

In [50]:
var=data1.groupby('gender')['math score','reading score','writing score'].var()
var

        math score  reading score  writing score
gender
female  256.958593     207.677438     220.369327
male    211.889097     200.211010     202.413924

In [76]:
## Female students have higher scoring variation for math, reading and writing than male students

## ● Test preparation course

In [51]:
var2=data1.groupby('test preparation course')['math score','reading score','writing score'].var()
var2

                         math score  reading score  writing score
test preparation course
completed                210.884027     183.265864     175.202612
none                     246.668662     213.419851     226.251739

In [ ]:
## Test preperation completed students have higher scoring variation for math, reading and writing than Non completed students

# 5. The management needs your help to give bonus points to the top 25% of students based on their maths score, so how will you help the management to achieve this.

In [75]:
print("\nBefore sorting:")
print(data1)
  
# sort data frame
data1.sort_values(["math score"], 
                    axis=0,
                    ascending=[False], 
                    inplace=True)
  
# displaying sorted data frame
print("\nAfter sorting:")
print(data1)

Before sorting:
     gender race/ethnicity parental level of education         lunch  \
999    male        group E           bachelor's degree      standard
998    male        group E          associate's degree  free/reduced
996    male        group A                some college      standard
515  female        group E                some college      standard
517  female        group E          associate's degree      standard
..      ...            ...                         ...           ...
2    female        group B            some high school  free/reduced
51   female        group C            some high school  free/reduced
3    female        group B                some college      standard
1    female        group B                 high school  free/reduced
0    female        group C            some high school  free/reduced

    test preparation course  math score  reading score  writing score
999               completed         100            100            100
998               completed         100            100             93
996               completed         100             96             86
515                    none         100             92             97
517                    none         100            100            100
..                      ...         ...            ...            ...
2                      none          18             32             28
51                     none          13             41             51
3                      none          11             38             32
1                      none           8             24             23
0                      none           0             17             10

[1000 rows x 8 columns]

After sorting:
     gender race/ethnicity parental level of education         lunch  \
999    male        group E           bachelor's degree      standard
996    male        group A                some college      standard
515  female        group E                some college      standard
517  female        group E          associate's degree      standard
516  female        group E           bachelor's degree      standard
..      ...            ...                         ...           ...
2    female        group B            some high school  free/reduced
51   female        group C            some high school  free/reduced
3    female        group B                some college      standard
1    female        group B                 high school  free/reduced
0    female        group C            some high school  free/reduced

    test preparation course  math score  reading score  writing score
999               completed         100            100            100
996               completed         100             96             86
515                    none         100             92             97
517                    none         100            100            100
516                    none         100            100            100
..                      ...         ...            ...            ...
2                      none          18             32             28
51                     none          13             41             51
3                      none          11             38             32
1                      none           8             24             23
0                      none           0             17             10

[1000 rows x 8 columns]

In [64]:
## Number of 25% of total students
len(data1)*0.25

250.0

In [62]:
##top 25% of students based on their maths score
data1.head(250)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
999,male,group E,bachelor's degree,standard,completed,100,100,100
517,female,group E,associate's degree,standard,none,100,100,100
516,female,group E,bachelor's degree,standard,none,100,100,100
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
...,...,...,...,...,...,...,...,...
415,female,group B,master's degree,free/reduced,completed,77,97,94
856,male,group E,some high school,standard,completed,77,76,77
855,male,group E,associate's degree,free/reduced,completed,77,69,68
854,male,group D,some high school,standard,completed,77,68,69
852,male,group D,some college,free/reduced,none,77,62,64